CSI API ETABS v1
cPropLink.GetNameList Method
 Retrieves the names of all defined link properties of the specified type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	eLinkPropType PropType =
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	Optional PropType As eLinkPropType =
) As Integer
Dim instance As cPropLink
Dim NumberNames As Integer
Dim MyName As String()
Dim PropType As eLinkPropType
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, PropType)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	eLinkPropType PropType =
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        ?PropType : eLinkPropType
(* Defaults:
        let _PropType = defaultArg PropType
*)
-> int
Parameters
NumberNames
Type: System.Int32
The number of link property names retrieved by the program.
MyName
Type: System.String[]
This is a one-dimensional array of link property names. The MyName array is created as a dynamic, zero-based, array by the API user: Dim MyName() as String
The array is dimensioned to (NumberNames - 1) inside the program, filled with the names, and returned to the API user.
PropType (Optional)
Type: ETABSv1.eLinkPropType
This optional value is one of the items in the eLinkPropType enumeration.
If no value is input for PropType, names are returned for all link properties in the model regardless of type.
Return Value
Type: Int32
Returns zero if the names are successfully retrieved; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim Ke() As Double
       Dim Ce() As Double
       Dim NumberNames As Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim DOF(5)
       ReDim Fixed(5)
       ReDim Ke(5)
       ReDim Ce(5)
       DOF(0) = True
       Ke(0) = 12
       ret = SapModel.PropLink.SetLinear("L1", DOF, Fixed, Ke, Ce, 0, 0)
   'get link property names
       ret = SapModel.PropLink.GetNameList(NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace